------------------------------------------------DEFAULT_nvim_config------------------------------------------
vim.opt.number = true           -- Номера строк
vim.opt.relativenumber = true   -- Относительная нумерация
vim.opt.cursorline = true       -- Подсветка текущей строки
vim.opt.tabstop = 4             -- Ширина таба
vim.opt.shiftwidth = 4          -- Размер отступа
vim.opt.expandtab = true        -- Преобразовать табы в пробелы
vim.opt.smartindent = true      -- Умные отступы
vim.opt.ignorecase = true       -- Нечуствительность к регистру во время поиска
vim.opt.smartcase = true        -- Если в поиске есть буквы в верхнем регистре, поиск чувствителен к регистру
-------------------------------------------------------------------------------------------------------------

